In [364]:
import pandas as pd
import numpy as np

data_file_df = pd.read_csv(data_file)
data_file_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [365]:
total_players = data_file_df.loc[:, ["Gender", "SN", "Age"]]
total_players = total_players.drop_duplicates()
total_players.head()
players_count=total_players.count()[0]
pd.DataFrame({"Total Number of Players": [players_count]})

   Total Number of Players
0                      576

In [366]:
average_price = data_file_df["Price"].mean()
average_price =round(average_price,2)

average_price

3.05

In [367]:
Total_expenditure = data_file_df["Price"].sum()

Total_expenditure

2379.77

In [368]:
Total_purchase_quantity = data_file_df["Purchase ID"].count()

Total_purchase_quantity

780

In [369]:
unique_items_count = len(data_file_df["Item Name"].unique())
unique_items_count

179

In [370]:
purchase_analysis = pd.DataFrame({"Number of Unique Items":[unique_items_count], 
                                  "Average Price in Dollars":[average_price],
                                  "Number of Purchases": [Total_purchase_quantity],
                                  "Total Expenditure": [Total_expenditure]})
purchase_analysis= purchase_analysis.set_index("Number of Unique Items")
purchase_analysis ["Average Price in Dollars"] = purchase_analysis["Average Price in Dollars"].map("${:,.2f}".format)
purchase_analysis ["Total Expenditure"] = purchase_analysis["Total Expenditure"].map("${:,.2f}".format)
purchase_analysis

,Average Price in Dollars,Number of Purchases,Total Expenditure
Number of Unique Items,,,
179,$3.05,780,"$2,379.77"

In [371]:
gender_count = total_players["Gender"].value_counts()



gender_count

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [372]:
gender_percentage = gender_count/ players_count

gender_percentage

Male                     0.840278
Female                   0.140625
Other / Non-Disclosed    0.019097
Name: Gender, dtype: float64

In [373]:
gender_analysis_df=pd.DataFrame({"Gender Count": gender_count, "Gender Percentage": gender_percentage})
gender_analysis_df["Gender Percentage"]=gender_analysis_df["Gender Percentage"].map("{:,.2%}".format)
gender_analysis_df

                       Gender Count Gender Percentage
Male                            484            84.03%
Female                           81            14.06%
Other / Non-Disclosed            11             1.91%

In [374]:
gender_total_price=data_file_df.groupby(["Gender"]).sum()["Price"].rename("Total Expenditure")
gender_total_price

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Total Expenditure, dtype: float64

In [375]:
gender_average=data_file_df.groupby(["Gender"]).mean()["Price"].rename("Average Purchase Price")
gender_average

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Average Purchase Price, dtype: float64

In [376]:
gender_purchase_quantity = data_file_df.groupby(["Gender"]).count()["Price"].rename("Purchase Count")
gender_purchase_quantity

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase Count, dtype: int64

In [377]:
avg_per_person_total = gender_total_price/ gender_analysis_df["Gender Count"]
avg_per_person_total

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [378]:
gender_df= pd.DataFrame({"Purchase Count": gender_purchase_quantity, "Average Purchase Price": gender_average, "Total Expenditure": gender_total_price, "Normalized Totals": avg_per_person_total})
gender_df

,Purchase Count,Average Purchase Price,Total Expenditure,Normalized Totals
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [379]:
gender_df["Average Purchase Price"]= gender_df["Average Purchase Price"].map("${:,.2f}".format)
gender_df["Total Expenditure"]=gender_df["Total Expenditure"].map("${:,.2f}".format)
gender_df["Purchase Count"]=gender_df["Purchase Count"].map("{:,}".format)
gender_df["Average Total Purchase/ Person"]= gender_df["Normalized Totals"].map("${:,.2f}".format)
gender_df=gender_df.loc[:, ["Purchase Count", "Average Purchase Price", "Total Expenditure", "Average Total Purchase/ Person"]]
gender_df

,Purchase Count,Average Purchase Price,Total Expenditure,Average Total Purchase/ Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [380]:
bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 140]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [381]:
total_players["Age Ranges"]=pd.cut(total_players["Age"], bins, labels=group_names)

In [382]:
age_count=total_players["Age Ranges"].value_counts()
age_count

20-24    258
15-19    107
25-29     77
30-34     52
35-39     31
10-14     22
<10       17
40+       12
Name: Age Ranges, dtype: int64

In [383]:
age_percentages= age_count / players_count
age_percentages

20-24    0.447917
15-19    0.185764
25-29    0.133681
30-34    0.090278
35-39    0.053819
10-14    0.038194
<10      0.029514
40+      0.020833
Name: Age Ranges, dtype: float64

In [384]:
age_demographics=pd.DataFrame({"Total Count": age_count, "Percentage of Players": age_percentages})
age_demographics["Percentage of Players"]=age_demographics["Percentage of Players"].map("{:,.2%}".format)
age_demographics=age_demographics.sort_index()
age_demographics

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

In [385]:
age_analysis=data_file_df
age_analysis["Age Ranges"] = pd.cut(data_file_df["Age"], bins, labels=group_names)

age_totals=age_analysis.groupby(["Age Ranges"]).sum()["Price"].rename("Total Expenditure")
age_average=age_analysis.groupby(["Age Ranges"]).mean()["Price"].rename("Average Purchase Price")
age_counts= age_analysis.groupby(["Age Ranges"]).count()["Price"].rename("Total Purchases")
normalized_total= age_totals/age_demographics["Total Count"]

age_df=pd.DataFrame({"Total Purchases": age_counts, "Average Purchase Price": age_average, "Total Expenditure": age_totals, "Average Total Purchase/ Person": normalized_total})
age_df

,Total Purchases,Average Purchase Price,Total Expenditure,Average Total Purchase/ Person
Age Ranges,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [386]:
age_df["Average Purchase Price"]=age_df["Average Purchase Price"].map("${:,.2f}".format)
age_df["Total Expenditure"]=age_df["Total Expenditure"].map("${:,.2f}".format)
age_df["Total Purchases"]=age_df["Total Purchases"].map("{:,}".format)
age_df["Average Total Purchase/ Person"]=age_df["Average Total Purchase/ Person"].map("${:,.2f}".format)
age_df=age_df.loc[:, ["Total Purchases", "Average Purchase Price", "Total Expenditure", "Average Total Purchase/ Person"]]
age_df

,Total Purchases,Average Purchase Price,Total Expenditure,Average Total Purchase/ Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

In [387]:
top_spenders_df= data_file_df
ts_total=top_spenders_df.groupby(["SN"]).sum()["Price"].rename("Total Expenditure")
ts_average=top_spenders_df.groupby(["SN"]).mean()["Price"].rename("Average Purchase Price")
ts_count=top_spenders_df.groupby(["SN"]).count()["Price"].rename("Total Purchases")
top_spenders_df=pd.DataFrame({"Total Expenditure": ts_total, "Average Purchase Price": ts_average, "Total Purchases": ts_count})

top_spenders_df.head()

              Total Expenditure  Average Purchase Price  Total Purchases
SN
Adairialis76               2.28                    2.28                1
Adastirin33                4.48                    4.48                1
Aeda94                     4.91                    4.91                1
Aela59                     4.32                    4.32                1
Aelaria33                  1.79                    1.79                1

In [388]:
top_spenders_df=top_spenders_df.sort_values("Total Expenditure", ascending=False)
top_spenders_df["Average Purchase Price"]=top_spenders_df["Average Purchase Price"].map("${:,.2f}".format)
top_spenders_df["Total Expenditure"]=top_spenders_df["Total Expenditure"].map("${:,.2f}".format)
top_spenders_df=top_spenders_df.loc[:,["Total Purchases", "Average Purchase Price", "Total Expenditure"]]
top_spenders_df.head()

             Total Purchases Average Purchase Price Total Expenditure
SN
Lisosia93                  5                  $3.79            $18.96
Idastidru52                4                  $3.86            $15.45
Chamjask73                 3                  $4.61            $13.83
Iral74                     4                  $3.40            $13.62
Iskadarya95                3                  $4.37            $13.10

In [389]:
pop_items_df= data_file_df
pop_items=pop_items_df.loc[:,["Item ID", "Item Name", "Price"]]

pop_items.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [390]:
item_expenditure=pop_items.groupby(["Item ID", "Item Name"]).sum()["Price"].rename("Total Expenditures")
item_average=pop_items.groupby(["Item ID", "Item Name"]).mean()["Price"].rename("Item Average Price")
item_count=pop_items.groupby(["Item ID", "Item Name"]).count()["Price"].rename("Total Purchases")

item_data_pd=pd.DataFrame({"Total Expenditures": item_expenditure, "Item Average Price": item_average, "Total Purchases": item_count})
item_data_pd.head()

,,Total Expenditures,Item Average Price,Total Purchases
Item ID,Item Name,,,
0,Splinter,5.12,1.28,4
1,Crucifer,9.78,3.26,3
2,Verdict,14.88,2.48,6
3,Phantomlight,14.94,2.49,6
4,Bloodlord's Fetish,8.50,1.70,5

In [391]:
pop_items=item_data_pd.sort_values("Total Purchases", ascending=False)
pop_items["Item Average Price"]=pop_items["Item Average Price"].map("${:,.2f}".format)
pop_items["Total Purchases"]=pop_items["Total Purchases"].map("{:,}".format)
pop_items["Total Expenditures"]=pop_items["Total Expenditures"].map("${:,.2f}".format)
pop_items=pop_items.loc[:,["Total Purchases", "Item Average Price", "Total Expenditures"]]


pop_items.head()

,,Total Purchases,Item Average Price,Total Expenditures
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

In [393]:
prof_items = item_data_pd.sort_values("Total Expenditures", ascending=False)

prof_items["Item Average Price"] = prof_items["Item Average Price"].map("${:,.2f}".format)
prof_items["Total Purchases"] = prof_items["Total Purchases"].map("{:,}".format)
prof_items["Total Expenditures"] = prof_items["Total Expenditures"].map("${:,.2f}".format)
prof_items = prof_items.loc[:,["Total Purchases", "Item Average Price", "Total Expenditures"]]

prof_items.head(5)

,,Total Purchases,Item Average Price,Total Expenditures
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80